leadsonline/SOAP XML - CheckDoNotBuy2 Example.txt

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<CheckDoNotBuy2 xmlns="http://www.leadsonline.com/">
			<login>
				<storeId>Your Store ID Number here</storeId>
				<userName>Your username here</userName>
				<password>Your password here</password>
			</login>
			<ID>Customer ID Number here</ID>
			<Name>Customer Name here</Name>
			<BirthDate>Customer Birth Date here (mm/dd/yyyy)</BirthDate>
		</CheckDoNotBuy2>
	</soap:Body>
</soap:Envelope>


NOTE: Using the following data will generate a "hit" on Sandbox:

Name:	FRANK FURTER
Id:	66778855
DOB:	1/1/1971

